#pragma once

//============================================================================
//	include
//============================================================================

namespace Engine {

	//============================================================================
	//	ICommand class
	//	コマンドの共通インターフェース
	//============================================================================
	template <typename T>
	class ICommand {
	public:
		//========================================================================
		//	public Methods
		//========================================================================

		ICommand() = default;
		virtual ~ICommand() = default;

		// 実行
		virtual bool Execute(T& context) = 0;

		// 処理の取り消し
		virtual void Undo(T& context) = 0;
		// 処理の復元
		virtual bool Redo(T& context) { return Execute(context); }

		//--------- accessor -----------------------------------------------------

		// デバッグ表示用
		virtual const char* GetName() const = 0;
	};
} // Engine