using NEMEngine;

namespace SandboxScripts;

//============================================================================
//	TestTransform
//============================================================================
public sealed class TestTransform : ScriptBehaviour
{

    //========================================================================
    //	開始時処理
    //========================================================================
    public override void Start()
    {
		// ワールド座標出力
		Debug.Log($"worldPos = {transform.position}");
	}

    //========================================================================
    //	毎フレーム更新処理
    //========================================================================
    public override void Update()
    {
		// ワールド座標出力
		Debug.Log($"worldPos = {transform.position}");
	}
}
