#pragma once

//============================================================================
//	include
//============================================================================
#include "AudioSoundData.h"

// c++
#include <filesystem>

namespace Engine {

	//============================================================================
	//	AudioDecoder class
	//	音声ファイルの復号とMediaFoundationの開始状態を管理する
	//============================================================================
	class AudioDecoder {
	public:
		//============================================================================
		//	public Methods
		//============================================================================

		// 復号処理を初期化
		void Init();
		// 復号処理を終了
		void Finalize();
		// WAVを読み込む
		AudioSoundData LoadWaveFile(const std::filesystem::path& filename);
		// MP3を読み込む
		AudioSoundData LoadMP3File(const std::filesystem::path& filename);
	private:
		//============================================================================
		//	private Methods
		//============================================================================

		//--------- variables ----------------------------------------------------

		bool mfStarted_ = false;
	};
}
