#include "ECSWorldLifetime.h"

//============================================================================
//	include
//============================================================================
// c++
#include <stdexcept>

//============================================================================
//	ECSWorldLifetime classMethods
//============================================================================

void Engine::ECSWorldLifetime::ThrowIfEnded() const {

	if (!alive_) {
		throw std::runtime_error("処理中にWorldが終了しました");
	}
}
