#pragma once

//============================================================================
//	include
//============================================================================

// .h,.cpp共通ルール
// 出来るだけ英語は使わない(あまりも不自然な場合はOK)
// 語尾に。をつけない
// コメント内に()文は書かない
// コメント内の文字の間にスペース入れない
// ファイル名、コードはCpu,Gpu,Api,Uuidなどは小文字ではなく、CPU,GPU,API,UUID(大文字)にしてください
// 上記にはルールがあり、ファイル名、クラス名は大文字でいいです。が、変数はローワーキャメルケースで、objectId->objectID,textureGpu->textureGPUにしてください

//============================================================================
//	TemplateClass class
//	クラス説明、1行で済ませる
//============================================================================
class TemplateClass {
public:
	//========================================================================
	//	public Methods
	//========================================================================

	TemplateClass() = default;
	~TemplateClass() = default;

	// 関数コメント、一行に必ず抑える
	void Init();
	
	// 関数コメント
	void Update();

	//--------- accessor -----------------------------------------------------

	// ゲッター、セッターはここ
private:
	//========================================================================
	//	private Methods
	//========================================================================
// ここは1行空ける
	//--------- structure ----------------------------------------------------

	// 構造体宣言はここ
	struct Temp {

		int temp = 0; // 変数コメント
	};

	//--------- variables ----------------------------------------------------

	// 定数は一番上
	const int kTest = 0;

	// 変数コメント
	int test = 0;

	//--------- functions ----------------------------------------------------

	// private関数にはすべてコメントを入れる
	void PrivateFunc();

	// カテゴリーが同じなら間を空けずに関数を書く
	// 関数コメント
	void School();
	// 関数コメント
	void HighSchool();

	// 関数コメント
	void School();
	// 関数コメント
	void HighSchool(int temp);

	// template関数はinlineで.hに書いてOK
	// template以外は1行で書ききれない限りすべて.cppにかくこと
	template <typename T>
	void TemplateFuncT(const T& t);
};

//============================================================================
//	TemplateClass classTemplateMethods
//============================================================================

template<typename T>
inline void TemplateClass::TemplateFuncT(const T& t) {

}