#include "TemplateClass.h"

//============================================================================
//	include
//============================================================================
// ここに.cppでのみのinclude

//============================================================================
//	TemplateClass classMethods
//============================================================================
// 一番上の関数の間は1行空ける
void TemplateClass::Init() {

	// 処理コメントは1行で収めて、長すぎないようにする
}

void TemplateClass::Update() {


}

void TemplateClass::HighSchool(int temp) {

	// 使用しない場合はvoid(temp)ではなく、そもそも引き数を消すか、[[maybe_unused]]を使う
}