#pragma once

//============================================================================
//	include
//============================================================================

// c++
#include <cstdint>
#include <string_view>

namespace Engine {

	//============================================================================
	//	EntityToTypeHash
	//============================================================================

	// 文字列からハッシュ値を生成する関数
	uint32_t EntityToTypeHash(const std::string_view& string);
} // Engine