#pragma once

//============================================================================
//	include
//============================================================================
#include "IParticleModuleDrawer.h"

namespace Engine {

	//============================================================================
	//	ParticleCurlNoiseModuleDrawer class
	//	渦を作るノイズの強さと移動を編集する
	//============================================================================
	class ParticleCurlNoiseModuleDrawer : public IParticleModuleDrawer {
	public:
		//========================================================================
		//	public Methods
		//========================================================================

		bool Draw(IParticleModule& module) override;
	};
}
