#pragma once

//============================================================================
//	include
//============================================================================
#include <cstdint>

namespace Engine {

	//============================================================================
	//	ALCUnloadStatus enum
	//	Assemblyの解放結果を表す
	//============================================================================
	enum class ALCUnloadStatus : int32_t {

		Unknown = 0,
		UnloadSucceeded = 1,
		LeakSuspected = 2,
	};
} // Engine
