#pragma once

//============================================================================
//	include
//============================================================================

// c++
#include <cstdint>

namespace Engine {

	//============================================================================
	//	ECSConfig
	//	ECSの設定、定数
	//============================================================================

	// 使用可能なコンポーネント種類の最大数
	static constexpr uint32_t kMaxComponentTypes = 256;

	// Archetype内でまとめて保持する単位の最大Entity数
	static constexpr uint32_t kChunkCapacity = 256;
} // Engine